from matplotlib.pyplot import *  # додаємо бібліотеку для побудови графіків

v = []  # об'єм (НЕ ЗАПОВНЯТИ)
p = []  # густина (НЕ ЗАПОВНЯТИ)
a = []  # довжина брусків (ПОТРІБНО ЗАПОВНИТИ ЧЕРЕЗ КОМУ В СЕРЕДЕНІ ДУЖОК, ПІСЛЯ ПРОВЕДЕННЯ ДОСЛІДІВ)
b = []  # ширина брусків (ПОТРІБНО ЗАПОВНИТИ ЧЕРЕЗ КОМУ В СЕРЕДЕНІ ДУЖОК, ПІСЛЯ ПРОВЕДЕННЯ ДОСЛІДІВ)
h = []  # висота брусків (ПОТРІБНО ЗАПОВНИТИ ЧЕРЕЗ КОМУ В СЕРЕДЕНІ ДУЖОК, ПІСЛЯ ПРОВЕДЕННЯ ДОСЛІДІВ)
m = []  # вагу брусків (ПОТРІБНО ЗАПОВНИТИ ЧЕРЕЗ КОМУ В СЕРЕДЕНІ ДУЖОК, ПІСЛЯ ПРОВЕДЕННЯ ДОСЛІДІВ)
counter = 0  # лічильник (НЕ ЗМІНЮВАТИ)

for i in a:
    v.append(a[counter] * b[counter] * h[counter])  # розрахунок об'єму тіла
    p.append(m[counter] / v[counter])  # розрахунок густини тіла
    print(f'Для досліду {counter + 1}, значення густини = {p[counter]} та значення об`єму {v[counter]}')  # # виведення отриманих значень на екран
    counter = counter + 1  # лічильник (НЕ ЗМІНЮВАТИ)

plot(m, p, 'b-')  # побудова графіку за вказаними координатами
savefig('Визначення густини тіла правильної геометричної форми.png')  # збереження файлу з графіком
show()  # відображення графіку на екрані
