from matplotlib.pyplot import *  # додаємо бібліотеку для побудови графіків

g = 10  # стала величина (НЕ ЗМІНЮВАТИ)
k = []  # значення жорсткості пружини (НЕ ЗАПОВНЯТИ)
Fpr = []  # значення сили пружності (НЕ ЗАПОВНЯТИ)
counter = 0  # лічильник (НЕ ЗМІНЮВАТИ)

m = []  # виміряне значення маси (ПОТРІБНО ЗАПОВНИТИ ЧЕРЕЗ КОМУ В СЕРЕДЕНІ ДУЖОК, ПІСЛЯ ПРОВЕДЕННЯ ДОСЛІДІВ)
x = []  # виміряне значення видовження пружини (ПОТРІБНО ЗАПОВНИТИ ЧЕРЕЗ КОМУ В СЕРЕДЕНІ ДУЖОК, ПІСЛЯ ПРОВЕДЕННЯ ДОСЛІДІВ)

for i in x:  # цикл для розрахунків
    Fpr.append(m[counter] * g)  # розрахунок значень сили пружності
    k.append(Fpr[counter] / x[counter])  # розрахунок значень жорсткості пружини
    print(f'Для досліду {counter+1}, значення сили пружності = {Fpr[counter]}, а значення жорсткості пружини = {k[counter]}')  # виведення отриманих значень на екран
    counter = counter + 1  # лічильник (НЕ ЗМІНЮВАТИ)

kc = sum(k)/counter  # розрахунок середнього значення жорсткості пружини
print(f'Середнє значення жорсткості = {kc}')  # виведення отриманих значень на екран

plot(Fpr, x, 'b-')  # побудова графіку за вказаними координатами
savefig('Дослідження пружних властивостей тіл.png')  # збереження файлу з графіком
show()  # відображення графіку на екрані
