from matplotlib.pyplot import *  # додаємо бібліотеку для побудови графіків

r = []  # значення опору (НЕ ЗАПОВНЯТИ)
di = 0.01  # відхилення вимірювання сил струму
du = 0.1  # відхилення вимірювання напруги

u = []  # виміряне значення напруги (ПОТРІБНО ЗАПОВНИТИ ЧЕРЕЗ КОМУ В СЕРЕДЕНІ ДУЖОК, ПІСЛЯ ПРОВЕДЕННЯ ДОСЛІДІВ)
i = []  # виміряне значення сили струму (ПОТРІБНО ЗАПОВНИТИ ЧЕРЕЗ КОМУ В СЕРЕДЕНІ ДУЖОК, ПІСЛЯ ПРОВЕДЕННЯ ДОСЛІДІВ)
p = []  # виміряне значення потужності (ПОТРІБНО ЗАПОВНИТИ ЧЕРЕЗ КОМУ В СЕРЕДЕНІ ДУЖОК, ПІСЛЯ ПРОВЕДЕННЯ ДОСЛІДІВ)

counter = 0  # лічильник (НЕ ЗМІНЮВАТИ)

for j in u:  # цикл для розрахунків
    r.append(u[counter] / i[counter])  # розрахунок значень опору для всіх вимірювань
    print(f'Значення опору для прстрою {counter+1} становить: ', r[counter])  # виведення значень опору на екран
    counter = counter + 1  # лічильник (НЕ ЗМІНЮВАТИ)

plot(p, i, 'b-')  # побудова графіку за вказаними координатами
savefig('Визначення опору за допомогою цифрового вимірювача струму.png')  # збереження файлу з графіком
show()  # відображення графіку на екрані

print(f'Похибка вимірювань сили струму = {di / i[1]}')  # похибка сил струму для досліду 1
print(f'Похибка вимірювань напруги = {du / u[1]}')  # похибка напруги для досліду 1
